prusa3d/Prusa-Firmware-Buddy/lib/CycloneTCP/drivers/mac/pic32mz_eth_driver.c
   //Enable the reception by setting the RXEN bit
   ETHCON1SET = _ETHCON1_RXEN_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


//PIC32MZ EC Starter Kit, PIC32MZ EF Starter Kit, PIC32MZ DA Starter Kit,
//PIC32MZ EF Curiosity, PIC32MZ EF Curiosity 2.0, PIC32MZ DA Curiosity or
//IoT Ethernet Kit?
#if defined(USE_PIC32MZ_EC_STARTER_KIT) || defined(USE_PIC32MZ_EF_STARTER_KIT) || \
   defined(USE_PIC32MZ_DA_STARTER_KIT) || defined(USE_PIC32MZ_EF_CURIOSITY) || \
   defined(USE_PIC32MZ_EF_CURIOSITY_2) || defined(USE_PIC32MZ_DA_CURIOSITY) || \
   defined(USE_IOT_ETHERNET_KIT)

/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

void pic32mzEthInitGpio(NetInterface *interface)
{
//PIC32MZ EC Starter Kit or PIC32MZ EF Starter Kit?
#if defined(USE_PIC32MZ_EC_STARTER_KIT) || defined(USE_PIC32MZ_EF_STARTER_KIT)
   //Disable analog pad on ETXD0 (AN35/RJ8)
   ANSELJCLR = _ANSELJ_ANSJ8_MASK;
   //Disable analog pad on ETXD1 (AN36/RJ9)
   ANSELJCLR = _ANSELJ_ANSJ9_MASK;
   //Disable analog pad on EREFCLK (AN37/RJ11)
   ANSELJCLR = _ANSELJ_ANSJ11_MASK;
   //Disable analog pad on ERXERR (AN40/RH4)
   ANSELHCLR = _ANSELH_ANSH4_MASK;
   //Disable analog pad on ERXD1 (AN41/RH5)
   ANSELHCLR = _ANSELH_ANSH5_MASK;

//PIC32MZ DA Starter Kit?
#elif defined(USE_PIC32MZ_DA_STARTER_KIT)
   //Configure PHY_RST (RJ15)
   TRISJCLR = _TRISJ_TRISJ15_MASK;

   //Reset PHY transceiver (hard reset)
   LATJCLR = _LATJ_LATJ15_MASK;
   sleep(10);
   LATJSET = _LATJ_LATJ15_MASK;
   sleep(10);

//PIC32MZ EF Curiosity?
#elif defined(USE_PIC32MZ_EF_CURIOSITY)
   //Disable analog pad on ERXERR (AN6/RB11)
   ANSELBCLR = _ANSELB_ANSB11_MASK;
   //Disable analog pad on ERXD0 (AN7/RB12)
   ANSELBCLR = _ANSELB_ANSB12_MASK;
   //Disable analog pad on ERXD1 (AN8/RB13)
   ANSELBCLR = _ANSELB_ANSB13_MASK;
   //Disable analog pad on ERXDV (AN12/RG8)
   ANSELGCLR = _ANSELG_ANSG8_MASK;
   //Disable analog pad on EREFCLK (AN11/RG9)
   ANSELGCLR = _ANSELG_ANSG9_MASK;

//PIC32MZ EF Curiosity 2.0?
#elif defined(USE_PIC32MZ_EF_CURIOSITY_2)
   //Disable analog pad on ETXD0 (AN35/RJ8)
   ANSELJCLR = _ANSELJ_ANSJ8_MASK;
   //Disable analog pad on ETXD1 (AN36/RJ9)
   ANSELJCLR = _ANSELJ_ANSJ9_MASK;
   //Disable analog pad on EREFCLK (AN37/RJ11)
   ANSELJCLR = _ANSELJ_ANSJ11_MASK;
   //Disable analog pad on ERXERR (AN40/RH4)
   ANSELHCLR = _ANSELH_ANSH4_MASK;
   //Disable analog pad on ERXD1 (AN41/RH5)
   ANSELHCLR = _ANSELH_ANSH5_MASK;

//PIC32MZ DA Curiosity?
#elif defined(USE_PIC32MZ_DA_CURIOSITY)
   //Configure PHY_RST (AN39/RE1)
   TRISECLR = _TRISE_TRISE1_MASK;
   //Disable analog pad
   ANSELECLR = _ANSELE_ANSE1_MASK;

   //Reset PHY transceiver (hard reset)
   LATECLR = _LATE_LATE1_MASK;
   sleep(10);
   LATESET = _LATE_LATE1_MASK;
   sleep(10);

//IoT Ethernet Kit?
#elif defined(USE_IOT_ETHERNET_KIT)
   //Disable analog pad on ERXERR (AN18/RE4)
   ANSELECLR = _ANSELE_ANSE4_MASK;
   //Disable analog pad on ETXEN (AN17/RE5)
   ANSELECLR = _ANSELE_ANSE5_MASK;
   //Disable analog pad on ETXD0 (AN16/RE6)
   ANSELECLR = _ANSELE_ANSE6_MASK;
   //Disable analog pad on ETXD1 (AN15/RE7)
   ANSELECLR = _ANSELE_ANSE7_MASK;
#endif
}

#endif


/**
 * @brief Initialize DMA descriptor lists
 * @param[in] interface Underlying network interface
 **/

void pic32mzEthInitBufferDesc(NetInterface *interface)
{
   uint_t i;

   //Initialize TX descriptor list
   for(i = 0; i < PIC32MZ_ETH_TX_BUFFER_COUNT; i++)
   {
      //Point to the current descriptor
      txCurBufferDesc = &txBufferDesc[i];

      //Use linked list rather than linear list
      txCurBufferDesc->control = ETH_TX_CTRL_NPV;
      //Transmit buffer address
      txCurBufferDesc->address = KVA_TO_PA(txBuffer[i]);
      //Transmit status vector
      txCurBufferDesc->status1 = 0;
      txCurBufferDesc->status2 = 0;
      //Next descriptor address
      txCurBufferDesc->next = KVA_TO_PA(&txBufferDesc[i + 1]);
   }

   //The last descriptor is chained to the first entry
   txCurBufferDesc->next = KVA_TO_PA(&txBufferDesc[0]);
   //Point to the very first descriptor
   txCurBufferDesc = &txBufferDesc[0];

   //Initialize RX descriptor list
   for(i = 0; i < PIC32MZ_ETH_RX_BUFFER_COUNT; i++)
   {
      //Point to the current descriptor
      rxCurBufferDesc = &rxBufferDesc[i];

      //The descriptor is initially owned by the DMA
      rxCurBufferDesc->control = ETH_RX_CTRL_NPV | ETH_RX_CTRL_EOWN;
      //Receive buffer address
      rxCurBufferDesc->address = KVA_TO_PA(rxBuffer[i]);
      //Receive status vector
      rxCurBufferDesc->status1 = 0;
      rxCurBufferDesc->status2 = 0;
      //Next descriptor address
      rxCurBufferDesc->next = KVA_TO_PA(&rxBufferDesc[i + 1]);
   }

   //The last descriptor is chained to the first entry
   rxCurBufferDesc->next = KVA_TO_PA(&rxBufferDesc[0]);
   //Point to the very first descriptor
   rxCurBufferDesc = &rxBufferDesc[0];

   //Starting address of TX descriptor table
   ETHTXST = KVA_TO_PA(&txBufferDesc[0]);
   //Starting address of RX descriptor table
   ETHRXST = KVA_TO_PA(&rxBufferDesc[0]);
   //Set receive buffer size
   ETHCON2 = PIC32MZ_ETH_RX_BUFFER_SIZE;
}


/**
 * @brief PIC32MZ Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void pic32mzEthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

void pic32mzEthEnableIrq(NetInterface *interface)
{
   //Enable Ethernet MAC interrupts
   IEC4SET = _IEC4_ETHIE_MASK;

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Enable Ethernet PHY interrupts
      interface->phyDriver->enableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Enable Ethernet switch interrupts
      interface->switchDriver->enableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

